print('Задача 7. За что?')

# Вы встретились со своим старым другом,
# который тоже изучает программирование, правда, в другом учебном заведении.
# За чашкой кофе он пожаловался вам,
# что сумасбродный препод дал им задание написать программу,
# которая из двух введённых чисел определяет наибольшее,
# не используя при этом условные операторы, циклы и встроенные функции вроде max/min/sorted.
#
# Радуясь, что на вашем курсе такого не требуют,
# вы всё-таки решаете помочь своему другу.
#
# Напишите для него эту программу.
#
# Пример:
#
# Введите первое число: 10
# Введите второе число: 5
#
# Наибольшее число: 10


try:
    # Инициализируем
    # Первое число для сравнения
    num_a: float = float(input("Введите первое число: "))

    # Второе число для сравнения
    num_b: float = float(input("Введите второе число: "))

    max_num: float = (abs(num_a - num_b) + (num_a + num_b)) / 2

    print(f"Наибольшее число: {max_num}")

except Exception as e:
    print(f"Что-то пошло не по плану: {e}")

a = 5
b = 7



